---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamInvalidElemParamValue
source: html/acf86ff5-b79e-56a7-73c1-c1449a0bd2c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GlobalParameterFailures.GlobalParamInvalidElemParamValue Property

Invalid value of parameter %1!s! in highlighted element.

## Syntax (C#)
```csharp
public static FailureDefinitionId GlobalParamInvalidElemParamValue { get; }
```